tutorials/heatTransfer/buoyantSimpleRadiationFoam/hotRadiationRoomFvDOMSpecularCeiling/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    floor
    {
        type            buoyantPressure;
        value           uniform 100000;
    }

    ceiling
    {
        type            buoyantPressure;
        value           uniform 100000;
    }

    fixedWalls
    {
        type            buoyantPressure;
        value           uniform 100000;
    }

    box
    {
        type            buoyantPressure;
        value           uniform 100000;
    }
}


// ************************************************************************* //
